---
kind: property
id: P:Autodesk.Revit.DB.Plumbing.PipePressureDropData.Friction
source: html/c95b0378-7b7e-8e81-b00a-334377bd3221.htm
---
# Autodesk.Revit.DB.Plumbing.PipePressureDropData.Friction Property

The friction of the pipe. Units: (kg/(ft²·s²)).

## Syntax (C#)
```csharp
public double Friction { get; set; }
```